[
  {
  "id": "5383",
  "header": "Tech stocks slump as BTC falls below $70,000",
  "date":  "6 February 2026",
  "description": "There is a hypothesis that many people are selling off tech stocks falling is due to people trying to cover their Bitcoin losses by liquidating their tech stocks in order to protect their portfolio."
  },
  {
  "id": "5379",
  "header": "SLV falls 30% while GLD falls 16%",
  "date":  "31 January 2026",
  "description": "This is the perfect storm: final trading day of the month, many options expiring and futures drawing closs, earnings seasons for big tech, halted trading in Shanghai. The major catalyst that popped the bubble and spooked speculators is not the nomination of new Fed chair Kevin Walsh but the margin hike of COMEX on Gold and Silver metal futures. Many highly/over-leveraged traders are margin-called and stopped out of their position, triggering a cascade of stop losses that pushed the momentum of precious metals down. Also it is fair to say that many people are taking profits too. This has happened once before during Hunt Brothers' attempt to corner to silver market and 2021. By speculating on metals you are playing on the turf of these big institutions: COMEX and JP Morgan's short positions. They are never afraid to short metals because as long as the metals go too high they can jsut raise margin requirements to crash it. That is why as good as it sounds that the macro conditions are pointing metals to go up, we should not trade it but invest in it long term because in the short term is market is susceptible to manipulation."
  },
  {
  "id": "5303",
  "header": "The most important trait to have in investing and trading is adaptability",
  "date":  "14 November 2025",
  "description": "When I sold my Micron stock on the 1st of October at $170 I thought i topped out and it is going to correct back down to the $150 levels. Instead, it just kept rising on news that Samsung and OpenAI has a partnership in Korea causing the stocks in the whole sector to jump. One thing this really proved to me is that the memory market is really cyclical with seasons of booms and bust and right now we are in the booming period. Though I missed out on the gain from $180 to $190, I didn't care, I reacted accordingly. I joined back the trade at $190 and recently Samsung announced that they are hiking memory chip prices and Micron is trading 6% up to $250. This shows us that even when you make a wrong call you can still find the next most beneficial course of aciton to fill in your lapse in judgement and that in the market nothing is static. Information is always changing therefore our strategy and gameplans have to be tweaked accordingly too."
  },
  {
  "id": "5293.5",
  "header": "ANET stock falls 12% in afterhours trading after its earnings report",
  "date":  "4 November 2025",
  "description": "Total revenue growth reported YoY is 26% to $2.31B. The stock fall despite earnings coming in line with analysts' expectation may be due to investors' concern about AI valuations and the broader market environment (macroeconomics and political). Some of ANET's potential challenges are increase in market competitors in the AI and cloud networking sector. However, I'm still bullish on this stock and I believe that $130 is a good price to enter as the DCF shows that at a 10 year forward CAGR of 20%, ANET is valued intrinsically at $168 a farcry from the $364 you would get if you expect it to grow its cash flow 36% over the next 10 years. At $168, though, it shows that the stock still has some upside. ANET primarily sells Ethernet switches and software to data centers and the circular AI economy and increasing capex spending going on in the tech sector will continue to boost ANET's revenue."
  },
  {
  "id": "5293",
  "header": "UBER falls 9% after its earnings and revenue beat",
  "date":  "4 November 2025",
  "description": "UBER announced a 20% YoY revenue growth and a EPS beat by $2.44 at $3.11 compared to analysts' consensus estimates of $0.67. However this increase in earnings is due to tax benefits instead of operations which explains some investor disappointment. Headwinds include robotaxi and autonomous cabs however trading at PE of 16 with huge cash flow not to mention the announced stock buyback this stock is very likely to grow in the coming year."
  },
  {
  "id": "5289.5",
  "header": "META slips 12% after its earnings report",
  "date":  "31 October 2025",
  "description": "META claims that taxes caused its EPS which should be $7.25 to be slashed to $1.05. Furthermore, META capital expenditure and costs also jumped by 32% due to investments in artificial intelligence and data centres."
  },
  {
  "id": "5289",
  "header": "UNH reported earnings and the outlook is not good",
  "date":  "31 October 2025",
  "description": "Based on DCF calculations, UNH is still a $800 stock but the possibility of it but the possibility of it reaching it is low. Their EPS decreased by 41% YoY although their revenue increased 12%. This makes UNH a StockScore rated stock of 8 instead of the previous assigned 18. I will continue to hold it though its value may be capped at $600 after this earnings report. It is a bad miss."
  },
  {
  "id": "5282.5",
  "header": "AMD hit new high $251",
  "date":  "24 October 2025",
  "description": "AMD keeps rising due to that OpenAI deal. No regrets for selling I loved my share of profits I'll leave the rest of that for others. Intel earnings report shows huge demand for the entire chip sector. The party is not ending soon."
  },
  {
  "id": "5282",
  "header": "Stock market rally After inflation data",
  "date":  "24 October 2025",
  "description": "CPI inflation numbers came in at 0.3% for September which is lower than the 0.4% expected."
  },
  {
  "id": "5275",
  "header": "OpenAI inked a new deal to partner up with AMD causing AMD to jump 35% in premarket trading to hit a trading price of $228",
  "date":  "7 October 2025",
  "description": "OpenAI has signed a deal with AMD where OpenAI will deploy 6 gigawatts of AMD GPUs including the latest MI450 chips about to release next year. Engineers at AMD are also working closely with OpenAI to improve their new generation chip through iterative feedback. AMD closed at $203, previous closing price was $166. I sold my option which has 74 days left to expiration. Thankfully I did not sell covered calls if not my profit upside would have been greatly diminished. Through this partnership agreement, OpenAI is also incentivised to assist AMD's growth and success as OpenAI is positioned to take up a 10% stakes over tranches of financial milestones accomplished. The final tranche includes seeing AMD's stock price rise to $600 a share. Management from AMD expects this partnership to generate tens of billions for the 4 years to come, improving both the top line and bottom line growth of AMD."
  },
  {
  "id": "5269",
  "header": "Micron (MU) pops 9% after news of OpenAI partnering with SK Hyinx and Samsung for GPU memory in Korean data centers.",
  "date":  "1 October 2025",
  "description": "DRAM are very important in AI inferencing and training. They are as vital as the NVIDIA GPU CUDA cores as they quick access for the tensorcores to compute from the cache and global memory. Micron stock climbs to $183 although this partnership does not involve Micron. This is due to the fact that this partnership of OpenAI with Korean memory manufacturers indicate that demand for memory for AI accelerators are at an all time time and the 2nd wave of AI has officially hit us. From the rise of Nebius (NBIS) appreciating 95% just over the past month, to Micron doubling its stock price from the start of the year, there has never been a period of greater demand for AI computation capabilities."
  },
  {
  "id": "5257.5",
  "header": "AMD down 5% after news of a Intel-Nvidia partnership",
  "date":  "18 September 2025",
  "description": "Intel jumped 26% upon news that NVIDIA will purchase Intel's common stock at a purhase price of $23.28 a share. They have also announced a strategic collaboration to develop AI infrastructure and personal computing products together. Moving forward, Intel will start building custom x86 CPUs for Nvidia's AI infrastructure platforms while Intel will develop x86 system-on-chips that integrate Nvidia RTX GPU chiplets."
  },
  {
  "id": "5257",
  "header": "UBER slides 5% upon news of Lyft's deal with Waymo in Nashville",
  "date":  "18 September 2025",
  "description": "This a a perfect mini dip to load up on UBER shares, I bought up 20 at $92.80 two days ago it was trading at the all-time-high level of $98. Lyft jumped 12% upon news that they have secured a deal with Waymo to serve riders in Nashville. Waymo is trying to shift away from an exclusive partnership with UBER so this will be a challenge for UBER in the years to come. One reason Waymo is doing this is so that they don't give UBER too much leverage over its own operations and competition increases the quality of service. However, UBER is a stock that can double in the next year so it's a good time to buy it now."
  },
  {
  "id": "5230",
  "header": "Market is facing slight correction upon rate cut uncertainty",
  "date":  "22 August 2025",
  "description": "Investors are rotating their positions out of risky high growth tech stocks into safer stocks after Walmart's earnings and outlook misses causing WMT to tumble 4.5%."
  },
  {
  "id": "5223",
  "header": "UnitedHealth Group UNH jumps 10% to $300 upon news that Berkshire Hathaway has taken up a long position of $1.6B on it",
  "date":  "15 August 2025",
  "description": "Value investors see the same opportunity. I was just talking about this stock to my family last week and talking about how undervalued it was at $246. Turns out, Warren Buffet thinks so too. But don't worry, if you think you have missed out on this stock, you haven't. This stock has the room to run up to $884. It is just that with the recent assasination and everything the stock is heavily plagued by bad news and guidance but that also means that the stock is heavily discounted. Once the sentiment change, this stock will likely not trade within these levels any longer. My DCF models showing a conservative 8% compound annual growth rate and a WACC of 6.2% puts UNH's intrinsic value to be at $884."
  },
  {
  "id": "5215.6",
  "header": "UBER has retraced its losses since posting earnings",
  "date":  "7 August 2025",
  "description": "Wall Street analysts are realizing that selling UBER after such an okay earnings coupled with a stock buyback program announcement was dumbfounded. Today UBER rose 3.87%. UBER is a very attractive proposition at this price point, and with this $20B buyback program announced it won't be hard for UBER to double its current price within the next year or so. This buyback shows that the UBER management is not fazed by autonomous cabs and strongly believes that UBER will still see higher growth via diversification into delivery and food services."
  },
  {
  "id": "5215.3",
  "header": "AppLovin (APP) up 12% post earnings",
  "date":  "7 August 2025",
  "description": "APP topped both revenue and earnings estimates. Even though it just pared its digital gaming ad segment, APP is still able to achieve such stellar performance. However, though the stock still has upside to $520 according to my DCF model I have decided to close my position in this stock because APP is a stock loved by short sellers which comes up with regular reports to slander AppLovin's business model. Instead, I will use the funds from APP and pour them in UBER, UNH and MP Materials appropriately."
  },
  {
  "id": "5215.2",
  "header": "AMD rebounded 5.69% and erased its post earnings losses",
  "date":  "7 August 2025",
  "description": "As Wall Street analysts had had the time to digest AMD's earnings transcript and realize that their outlook has not even included the expected go-ahead export sales to China that AMD's growth story is still robust. They are starting to wake up to it that is why we see buying of AMD on the street today. AMD still remains a good holding position even at this high price point of $172 because of the hype it has behind it. Every YouTube investing channel is talking about it, blogs are talking about it. Its average daily trading volume is 50M for reference UBER only has 20M. It's not impossible for AMD to hit the $205-$210 target but I'll get off the train once it does hit that price point and look for opportunity elsewhere there are so many opportunities in the market currently. To name a few: ANET, MP, UBER, UNH."
  },
  {
  "id": "5215",
  "header": "Bought some MP Materials (MP) stock at $71 upon pre earnings rally",
  "date":  "7 August 2025",
  "description": "So the story about how this stock caught my attention is that I was watching Apple's presentation about the implementation of tight loop of US manufacturing for their next gen products which includes the manufacture of chips and final assembly to be done within US soil. In the far corner of Apple's proposed $100B investment presentation board I saw the words MP Materials. MP Materials is a company that supplies raw earth to tech companies and these raw earth metals are crucial and fundamental in the production of chips whether for AI application or a normal tech device. I also recalled that MP Materials recently the US Defense Department to sign on as a major institutional investor in what would become a 10-year deal where the Pentagon will try to rely less on Chinese raw earth imports and MP Materials will fill that position. When MP Materials posted earnings in the aftermarket, its stock rose another 8.3% to $77. I'm planning to hold to for a mid-term I think with all the potential contracts coming to this company which operates in a space with little competition or has obscure competitors that I haven't heard of at least, this company's market capitalization can easily hit upwards of $50B. As of now, MP is only trading at $12.8B market capitalization so plenty of room for growth."
  },
  {
  "id": "5214.5",
  "header": "UBER stock down 2.5% after earnings and revenue beat",
  "date":  "6 August 2025",
  "description": "Though UBER beat earnings and revenue it wasn't by alot only by 4% and 1.5% respectively. Furthermore, UBER also announced a $20B stock buyback program which means that you can expect UBER's stock to climb in the future. So for a earnings beat and stock buyback program to cause a fall in the stock price is dumbfounded, the market will quickly realise the bizarre sentiment and reverse course."
  },
  {
  "id": "5214.3",
  "header": "AMD down 5% after both earnings and revenue beat",
  "date":  "6 August 2025",
  "description": "AMD CEO Lisa Su admitted that the Trump export restrictions hurt AMD by at least $800M but is positive that the future will improve since the Trump administration has given the go ahead to continue sales to China. One main reason AMD is falling is because its data center revenue merely matched the analysts' consensus meaning that data center growth may not be as robust as initially expected. However, if they receive green light for chip exports to China, AMD may see higher growth next year."
  },
  {
  "id": "5214",
  "header": "ANET up 15% post earnings",
  "date":  "6 August 2025",
  "description": "Like StockScore suggests, ANET's fundamentals are sound and the wall street analysts are just waking up to how good a stock ANET is. ANET has reached its all time high today at $139 after a surprise earnings and revenue beat. The primary driver behind ANET's stellar outlook is due to rising demands for AI/ML-driven network architectures. In my opinion ANET still has plenty of room to grow in the $200-$300 range and it's still not too late to invest in ANET today."
  },
  {
  "id": "5210",
  "header": "UNH continues to fall after bad earnings report",
  "date":  "2 August 2025",
  "description": "UNH has reached a new recent low of $237. With a PE ratio of 10.33 it is presenting a very attractive value opportunity right now. Although they report a surprise miss of 7% for their EPS number their revenue still growed 13% year-over-year. If we take this growth rate as the compound annual growth rate of UNH for the next 10 years, this stock's intrinsic value is 3x the price it is trading at now. Like Warren Buffet always says buy when others are fearful and sell when others are greedy."
  },
  {
  "id": "5209",
  "header": "Red across the board: stocks open with a notable pullback from tech highs as S&P500 sinks 1.7%",
  "date":  "1 August 2025",
  "description": "Weak jobs report coupled with renewed Trump tariff uncertainty has pulled the market back from a brief bull runup. AMD recently hit $184 with many other stocks like ANET hitting $125 but today they are below those price levels. A stock fall before earnings report could provide a scenario of a stock rebound back to their recent highs after the earnings report. Not an opportunity to buy as of yet but it also won't be a wrong choice if you do. A 1-2% S&P500 correction or a 5% correction in a tech stock is not a major pullback I would aim for at least 4% from recent high for S&P500 as a signal to buy or a 15% and above drawdown for me to DCA in a stock. This weak jobs report benefits the market as the Fed will have to do quantitative easing sooner than later and the interest rate will go down making more money flow into the stock market which will benefit investors with open positions. In conclusion my verdict is to hold your cash first, wait and see."
  },
  {
  "id": "5180.5",
  "header": "UNH down 5% as investors anticipate that Medicaid cuts would lower UNH's revenue",
  "date":  "3 July 2025",
  "description": "In order to get stocks for cheap, the stock has to be first disregarded by others. For example in Feb 4 2025, in order to get NVDA stock for $116 you had to deal with the fact that DeepSeek's release made people think NVIDIA cards so good that you don't need many of them. Or in DLTR case, tariff uncertainty in March 2025 made the stock trade at only $61 down 50% from its most recent all time high, now that everything has passed DLTR is trading back at $106. So the method for investors to invest profitably and beat the average market return is to determine whether the headwinds the company is facing is less concerning than the discount it is trading at. I feel like this Medicaid concern is not a major one so my faith in UNH stock rebounding is high. I might even purchase more stocks to average down and I believe once these concerns are disproven, the stock will quickly recover."
  },
  {
  "id": "5180",
  "header": "Adobe Inc (ADBE) is trading at a huge discount but there are things to note",
  "date":  "3 July 2025",
  "description": "ADBE shares just fell another 3.5% to $378, 36% down from its 52-week high of $587 and way below its implied intrinsic share price of $641. However like most companies with solid fundamentals but trading at a discount, there are several headwinds that Adobe is facing. First off is its failed acquisition of UI/UX design rival firm Figma for $20B. Secondly, with image generative AI techs creative suites offered by Adobe may be disrupted. Thirdly, Adobe is not a very ethical company as it always squeezes its customers for revenue growth and uses its customers' work to train its AI on which cause many customers to switch away from Adobe apps. However, if you can look past these headwinds Adobe is actually a consistently growing company with a reliable subscription driven recurring revenue."
  },
  {
  "id": "5177.5",
  "header": "SOFI and Robinhood (HOOD) Stocks Rip Through New Highs Riding the Stablecoin and GENIUS Act Hype",
  "date":  "30 June 2025",
  "description": "I made an ill-researched decision of getting rid of all my SOFI position at $15.30 last week not knowing about the GENIUS act and blindsided by how Trump's tax cuts would inject more money into the stock markets even without the Fed cutting rates. At $18.81 now, I really think that SOFI is overvalued though their financials of having recently turned profitable sounds good and I don't see why SOFI would not reach upwards of $20. I will however be sitting out of this stock because there are just so many other stocks with even better fundamentals and growth story trading at a more attractive price. To sum up what the recently passed GENIUS entails: 1) Only financial entities like SOFI, JPM, HOOD and others can issue stablecoins. 2) Stablecoins must be audited. 3) Only approved stablecoins can traded on US platforms. What this means is that if big retailers like Amazon or Walmart want to roll out usage of their own stablecoins, they have to go through financial players like SOFI or JPM whcih presents growth opportunities especially for fintech companies like AFRM, HOOD, SOFI over legacy institutions like BA, JPM."
  },
  {
  "id": "5177",
  "header": "Juniper Networks (JNPR) Stock Up 13% After DOJ Approval of Acquisition By Hewlett-Packard (HPE)",
  "date":  "30 June 2025",
  "description": "Arista Network's (ANET) competitor Juniper (JNPR) which is valued at $13B is approved by the DOJ to be acquired by Hewlett-Packard (HPE) for $14B. This news has caused its share price to soar 13% while ANET has a renewed mega competitor in HPE."
  },
  {
  "id": "5173",
  "header": "Micron Technology (MU) Beat On Both Revenue and EPS Numbers",
  "date":  "26 June 2025",
  "description": "MU price bounced upward to $136 for a brief stint after its earnings report came out in after hours trading before falling back to $128. MU has been having a decent rally for the past month so it's reasonable that some traders feel like the price it's at now has already taken into account these earnings beat. Revenue for the quarter up nearly 40% whilst the EPS for this quarter almost doubled from last year. Some analysts are attributing these huge growth to the early buying many buyers are doing when the April tariffs were announced to get the memory and storage chips before import tariffs and inflation make them more expensive. The way I see it is that companies that have huge earnings growth are more likely to have huge earnings growth again due to growth momentum and companies using that additional income to grow which creates a positive feedback loop. The other reason why I held onto this stock past its earnings report is because in StockScore MU is rated with a score of 17 which means that it has good fundamentals. Citi just assigned a price target of $150 to MU just $6 higher than my projection. I think I will be exiting the position after $150 max too because past that price point the stock is trading above its fair value and is no longer attractive like how Broadcom is looking now. I would rather lock in the profits and use those MU gains to explore value opportunities in other stocks like ANET."
  },
  {
  "id": "5172",
  "header": "HOOD and UBER Both Rallied 7% Last Night",
  "date":  "25 June 2025",
  "description": "I was just about to buy Robinhood (HOOD) stock at $82 even it's very overvalued but as a wise guy once said, 'When i spot a bubble, i buy in'. Comparing HOOD and UBER, one is a hype train driven by future growth expectation whereas UBER is still undervalued with better fundamentals. I feel like the fair price to buy HOOD without the hype is at $30-$60 but that train has left the station. Now the only price you can get from HOOD is the pumped up, future expection priced in price of $82. I'm not implying that HOOD has no further room to grow. On the contrary, I think HOOD will reach PLTR levels of $140 driven by hype, meme-ability and speculation. However as with anything governed by hype, you need to depend on hype which is never guaranteed to continue forever. On the other hand, you have a value stock that is UBER trading at a much lower PE ratio compareed to HOOD and has recently turned profitable and grown its free cash flow from 2022 to 2024 with a compound annual growth rate of 320%. Furthermore, UBER is rated at 19.831 compared to HOOD's 18.985. And the problem with financial stocks like HOOD is that you can't run a basic DCF model to see what price you should buy it at because financial companies use the cash flow for operations and regulatory compliance so it's better to use other valuation methods like EV/Revenue or EV/EBITDA. I got the price of $166 for UBER in my DCF and this price is more attainable to UBER than $140 is to HOOD. UBER, currently trading at $$91.65, is trading lower than its intrinsic share price of $166 while HOOD, currently trading at $82, is trading above its fair price of $60."
  },
  {
  "id": "5171",
  "header": "AMD Broke the $135 Support Line",
  "date":  "24 June 2025",
  "description": "Though the first target of $136 is reached, I will not be taking profit and will keep all my AMD positions intact. My position size is now at $10k. My next target range is $150-$175, let's see if it can reach this before August. My ultimate price target is $205, the moment the stock breaches the $210 it will be considered expensive and a little overvalued and I will trim my position sizing to an insignificant amount. Otherwise, I'm totally in and bullish to see it rise."
  },
  {
  "id": "5170.4",
  "header": "Recently Sold Off All of My SOFI Stock",
  "date":  "23 June 2025",
  "description": "SOFI is a stock you should own if you think the Fed is going to cut interest rates anytime soon which I think won't happen. Tariffs and economic uncertainty are causing inflation to become more sticky so I don't optimistically expect any rate cut until probably late into the year maybe somewhere in December. For that reason, SOFI with its mediocre fundamentals does not interest me (no pun intended). However, if you are planning to earn extra income by selling covered calls with SOFI that may be a solid strategy."
  },
  {
  "id": "5170.3",
  "header": "Tesla Up 10% After The First Robotaxi Hit The Streets",
  "date":  "23 June 2025",
  "description": "Tesla shareholders can finally catch a break and the long promised assurance is finally delivered. To me I see this Robotaxi rollout more as a liability than something to be celebratory about. Without any LiDAR sensor mounted, it is just a disaster waiting to occur — one mishap due to poor weather conditions, where the camera vision-dependent ML detection cannot operate effectively, could lead to catastrophic failure with potentially fatal consequences. When that happens, Tesla's share price will surely be affected. We will have to wait and see how this one pans out. But I'm out of Tesla regardless unless it trades back down to April 2024 levels of $140."
  },
  {
  "id": "5170.2",
  "header": "HIMS Falls 24% After Novo Nordisk Terminates Partnership with Hims & Hers",
  "date":  "23 June 2025",
  "description": "Novo Nordisk is citing copycats of Wegovy as grounds for terminating its deal with HIMS. To be honest, I never saw the appeal of a hype stock like HIMS but I almost bought it after seeing how much its stock has grown over the past year. Investing is simple just hold good stocks and HIMS is just not a good stock with superb fundamentals."
  },
  {
  "id": "5170",
  "header": "Bought Into ANET At $86.22",
  "date":  "23 June 2025",
  "description": "After seeing the ANET price direction of up in StockNet, I entered into a fresh position on this stock as the market opened. After the inital blip of -0.89%, the stock is now up 5.34% as of this writing intraday. I have designated more funds to dump into this stock shall it fall further but for now I'm satisfied with my position size and it's always a good feeling to have a stock rally a little right after you buy it."
  },
  {
  "id": "5169.5",
  "header": "Why Arista Networks (ANET) is a Good Buy Right Now",
  "date":  "22 June 2025",
  "description": "Following the recent stock gains of Oracle, there is one other competitor of Oracle that has better fundamentals than Oracle but lower trading multiples and that stock is ANET. I ran the stock through my one-click DCF app StockDCF and if we expect the growth rate from the last 10 years to continue well into the next 10 years, the stock is valued at $361 which represents massive upside for this quiet stock that most people in the public do not hear about when compared to the likes of Oracle, Broadcom and IBM. Its fundamentals are also sound. With a rating of 17.348 in StockScore although the score is a little lower than Broadcom by 1, its trading at a very attractive price right now. Furthermore, there is a recent dip on the stock which means that Monday may be a good time to enter into a position on ANET. In my DCF model when if I tune the growth rate to match the intrinsic value to the current trading price, I get 15.91% compound annual growth rate for the next 10 years, which is honestly a good conservative growth rate and the worst case scenario. All this means is that basically in the worst case scenario that it experiences conservative growth over the next 10 years, you are buying it at a fair price. But if it does continue on its growth trajectory of 36% annually this stock is on a discount."
  },
  {
  "id": "5169",
  "header": "I Just Realized How Good of a Stock Robinhood (HOOD) Is",
  "date":  "22 June 2025",
  "description": "HOOD is really a stock that has good fundamentals and I don't see how it will struggle to grow in the long term. However, I still feel like the ship has left the dock at this current valuation and the right time to buy was on April 3rd 2025. Though I still see how it may flip to the upside of $120 range, the value proposition just isn't there at $78. The gain to $120 is not guaranteed and I personally also feel like $60 is a fair price for the stock which means right now the future is a little too priced in. Since stocks like this that are fueled by a little bit of hype are cyclical, you don't have to buy in right away you may wait for the hype to die down before you start your entry position. That will be the approach I take for HOOD, wait for the $60 entry point. In StockScore, the stock is rated 18.985 which is really good."
  },
  {
  "id": "5164",
  "header": "AMD Surge 9% On Monday",
  "date":  "17 June 2025",
  "description": "After a short break over the weekend, investors have started to digest what AMD unveiled in last week's AI event coupled with a hint at a de-escalation in the Middle East. AMD is positioned very well to capitalize on the next wave of data center growth revenue as more and more companies tune in to the AI race by expanding their processing capacity. AMD's strategic partnership with Meta, Microsoft, Oracle, OpenAI and xAI (including a possible AWS partnership) also allows it to benefit from the ecosystem of AI frontrunners. I have been championing this stock since the start of the year and I'm planning to hold it until it reaches the range of $150-$175. In my opinion, AMD will hit $135 easily before August should there be no geopolitical disruption. Update: my 19 Dec 2025 AMD Call Option of Strike $90 is now valued at $4.13k."
  },
  {
  "id": "5160",
  "header": "Visa and Mastercard Down 6% Amid Reports That Retailers Like Amazon & Walmart Are Exploring Development of Their Own Stablecoins",
  "date":  "13 June 2025",
  "description": "The fear is overblown in my opinion, the duopoly of Visa and Mastercard is so entrenched in the payments sector that they will not disappear without a huge catalyst. Even as many countries roll out their own digital payments service, the credit cards from Visa and Mastercard are still widely used because of the seamless transaction experience of swapping a card or tapping your phone. Beyond that, the economies of scale of Visa and Mastercard allow card holders to redeem perks like airport lounge access or flight redemption. On the other hand, I think this move will greatly affect Paypal's underlying business because unlike payment giants like Visa and Mastercard, Paypal hasn't reached that level of reputation and it is a hassle to go through their customer service and account resolution speaking as a Paypal user myself."
  },
  {
  "id": "5153.5",
  "header": "TSLA takes a 14% Hit From Apparent Musk and Trump Rift",
  "date": "6 June 2025",
  "description": "Elon Musk who has stepped away from DOGE as a special government employee recently criticized the restoration of tax cuts proposed by Trump in the Big Beautiful Bill after the expiration of the 2017 tax cuts. No doubt this will increase the short term US fiscal spending and enlarge the deficit. This effect in turn will cause record levels of national debt and naturally a higher interest payment as investors' fear of the irresponsible, uncontrolled spending kicks in. Many speculate that Musk is bitter about leaving DOGE and Trump taking away his EV mandates which provides EV incentives to EV car buyers. Where the $1.6T in savings comes from nobody knows. One thing that is more probable is a spending deficit. Aside from tax cuts, the bill also includes cost-cutting measures like new Medicaid work requirements and the cancellation of food stamps. However the $1.2T in spending cuts is not enough to offset the $3.7T in lost revenue over the next decade. The concept of trickle-down economic cuts to stimulate economic growth has been around since the Reagan era. The idealistic idea of allowing the rich to keep more money so that they will expand their businesses and hire more workers thereby pushing the economy forward is not exactly clear cut. As we know, the average propenstiy to save increase with income, so the wealthy are less likely to spend the extra income from tax cuts. Even when they invest that money, there’s no guarantee it stays in the U.S. They can outsource jobs, invest in foreign markets, or park money in offshore accounts, none of which helps American workers. All it does is just making the rich wealthier and the inequality gap wider. And a very wide inequality gap is always an indication to a country's decay."
  },
  {
  "id": "5153",
  "header": "DLTR Stock Gains 9% After Rating Upgrades",
  "date": "6 June 2025",
  "description": "After the poorly received earnings report from DLTR two days ago, many analysts are putting on an undervalued tag on this stock. This upwards momentum has erased all the losses incurred right after the earnings report."
  },
  {
  "id": "5151",
  "header": "Dollar Tree (DLTR) Plummets 9% Even Though It Beat Earnings",
  "date": "4 June 2025",
  "description": "After issuing weak guidance due to the tariffs' impact, DLTR once again finds itself in the hot seat. DLTR has been reporting earnings one day after DG and lately it's been faring worse than DG. If DG posts a bad earnings and has a 5% correction you will see DLTR correct by more than 10%. It feels like Dollar General is the better corporation after all. DG is currently trading at a slight premium over DLTR and if I were to place my money in either one of these stocks it would be on Dollar General. We should also take into account the spinoff of Family Dollar from DLTR which costs DLTR $7B in equity losses by selling it to Brigade Capital for $1B when it bought Family Dollar for $8B."
  },
  {
  "id": "5150.5",
  "header": "Dollar General (DG) Posts Record Sales in its Latest Earnings",
  "date": "3 June 2025",
  "description": "One unexpected angle that dollar stores are experiencing from tariff uncertainty is that people are feeling pessimistic about the economy too and are trying to save as much as possible so they turn to shop in dollar stores. Initially, it is thought that the tariff war will hurt dollar stores like Dollar Tree and Dollar General as most of their merchandises' supply chains can be traced back to China. Surprisingly, both DLTR and DG stocks have been holding up quite well being up 24% and 43% year-to-date respectively. Turns out some things aren't as clear cut and there is always opportunity in a crisis."
  },
  {
  "id": "5150",
  "header": "Hims & Hers Health Inc. (HIMS) jumps 15% Upon News of ZAVA Acquisition to Boost European Expansion",
  "date": "3 June 2025",
  "description": "ZAVA is a European digital health platform. By acquiring ZAVA it makes HIMS's expansion into territories like the Ireland, Germany and France more seamless. This will allow HIMS to achieve the forecast and expected growth that is so baked in to its price which is trading at a PE ratio of 96. Although this entirely cash-funded acquisition will hurt the company's free cash flow in the short term, I believe the benefits it brings from increased future revenue outweighs it."
  },
  {
  "id": "5138",
  "header": "Reading What The Luck by Gary Smith Affirmed Some of My Investing Principles and Gave Me Knew Insights About Making Money in the Stock Market",
  "date": "19 May 2025",
  "description": "1: The stock market overreacts to good or bad news sometimes causing the stock price to be temporarily too high or too low. These temporary excesses create profitable opportunities for a contrarion strategy of buying what others are selling and selling what others are buying. 2: Companies with the most optimistic forecast may be likely to be overly optimistic than excessively pessimistic and will probably not do so well. Similarly, most pessimistic predictions are likely to be too pessimistic and they're more likely to beat the gloomy predictions. Pessimistic portfolios are more likely to trounce the optimistic portfolio. Gary Smith concludes that the markets do miss the $100 bill laying on the sidewalk. 3: Deleted stocks from the Dow may outperform stocks that replace them over a 10 year subsequent period when compared to the S&P500 due to regression to the mean. Sometimes when a stock is added to the Dow, its stock performance may be superb causing PE ratio to be excessively high and its stock price highly inflated. Even for companies with good moat and fundamentals, at one point the price will be too high and the same applies to deleted stocks, there is going to be a price so low that it becomes attractive. And this is why the deleted stocks over outperform because the high growth experienced by the added stocks may be attributed to luck and good luck rarely repeats. Having said this, it is highly impractical and borderline dangerous to expect NVIDIA to continue on its 40% plus annual growth rate for the next 10 years. In conclusion for stocks, a contrarion strategy can be employed—avoiding companies that have done well or are predicted to do well and investing in out-of-favour stocks. In the same way, stocks that drop sharply are often better investments than are stocks that surge, and stocks that are removed from the Dow are generally better investments than the stocks that replace them. This is counterintuitive for most investors, which leaves $100 bills on the sidewalk for those who understand regression."
  },
  {
  "id": "5134.5",
  "header": "UnitedHealthcare Stock Plummets Another 16% On DOJ Medicare Fraud Probe",
  "date": "15 May 2025",
  "description": "Share of UnitedHealthcare has fallen further to half its market cap from $500B high last year. This comes after a big fall 2 days ago upon news of newly appointed Andrew Witty leaving due to personal reasons where we saw the stock reach $310 and today it has reached new lows in the range of $260. According to my StockScore linear regression analysis, UNH which is rated 16.156 should only be -3% from last year instead it is trading -50% from last year so it definitely presents a buying opportunity. As Warren Buffet always say 'Be fearful when others are greedy and be greedy when others are fearful.' One big secret ingredient to invest profitably is discipline and that is what we will have by dollar cost averaging into cheaper amounts."
  },
  {
  "id": "5134",
  "header": "AMD breaks above $120 from its April 8 low of $78",
  "date": "15 May 2025",
  "description": "AMD recently announced a board approved $6B in stock buyback signalling to investors that they are fairly optimistic on the company's growth trajectory for future. Do I personally like this buyback? No even though it benefits my call option. I would prefer they spend this capital on ramping up production to solve the supply shortage of their recently released GPUs RX 9070 and RX 9070 XT. However, this may not necessarily be a bad move for them to raise capital in the future as the stock appreciates due to its cheap stock price right now. And we can see with NVIDIA's August 2023 $25B buyback announcement they bought it for cheap right before the 2024 NVIDIA stock price sprint. $6B is a conservative figure in AMD's terms and I am satisfied with the way the management is maneuvering around this uncertain time. According to my DCF model, if we expect AMD's compound annual growth rate to be at 43% (similar to the period of 2019-2024) then with a discout rate of 15% we get its estimated intrinsic value to be $198."
  },
  {
  "id": "5133.5",
  "header": "UnitedHealthcare Stock Tumbles Another 13%",
  "date": "13 May 2025",
  "description": "This latest fall in share price comes after a CEO resignation and the simultaneous withdrawal of a financial outlook. Previously, I bought this stock as a discount play where stocks that drop by alot (e.g. Salesforce, CrowdStrike) tend to recover after 6 months to a year due to the thoery of reactive adaptability where the managing directors will step in and bandage the market cap bleed by introducing policy changes or managerial structural changes. In the event of such occurences, the stock usually improves and I am betting on that happening. UNH is a blue chip after all who wouldn't want a piece of a cash cow machine on sale."
  },
  {
  "id": "5133",
  "header": "Google Stock is the Best Long Term Market [3-5 Years] Play Right Now",
  "date": "13 May 2025",
  "description": "Compared to other MAG 7 stocks Google's stock performance has been lagging behind since the past year up till now. The way I see Google is that it is in the same position that Meta was in back in 2022. Many people speculated that Instagram was dead as waves of tiktok adoption soar in the US. Meta's stock was seen as dirt and it's stock price was heavily discounted and undervalued at about $99 at its lowest. Since then it has moved upwards by 550% in a span of 3 years. Right now Google is in the same disposition. 'LLMs will kill Google Search'; 'Anti-Trust Monopoly Lawsuits will cause Google to break and be susceptible to attacks by competitors'. There has never been a better time to buy Google shares if you are in it for the long term because though there will be more pain in the near term, I highly believe that they will emerge the same as Meta. Other than Search, they have YouTube, Waymo, Google Cloud, Google Workspace, Google Maps and a platform to discover restaurants and bars (though this area has also been contested by the better reccomendation algorithm that Little Red Note has). Google is not going anywhere soon but before you enjoy the profits from Google stocks probable appreciation, you will need to be able to stomach the stock trading sideways and its divisions getting broken up."
  },
  {
  "id": "5132",
  "header": "Temporary De-Escalation of the US-China Trade War",
  "date": "12 May 2025",
  "description": "US Stock Market in the green today after the US cut the tariffs imposed on Chinese imports to 30%. Even highly volatile stocks like AppLovin or Hims & Hers Health are reclaiming their hefty growth premiums reflected by the stock price. Tesla and the overall chip sector (AMD, AVGO, NVDA) are also benefitting from this deal with their stocks trading upwards of 4%. My AMD call option with a strike of $90, delta 0.8, is now trading at the breakeven point of no profit or loss. This shows that if you can't stomach volatility then don't play with options as I know a few friends that sold their call options at a loss a month ago when the stock market was at its worst. If your option is not expiring soon let it enjoy its time priviledge as the movement of a stock's price can move drastically in a matter of days."
  },
  {
  "id": "5128",
  "header": "AppLovin Stock Up 14% Post Earnings Beat",
  "date": "8 May 2025",
  "description": "Earnings beat by 15%. A DCF valuation is called for at this stage to determine if there is any further upside for the stock in intrinsic value."
  },
  {
  "id": "5106",
  "header": "US-China Tariff War. China: Protect the Yuan or Weaken the Yuan",
  "date": "16 Apr 2025",
  "description": "With tariff rate from the US administration as high as 245% on Chinese goods, the Chinese exporters are definitely going to feel the pinch. Now that there will be lesser demand for the Yuan as the demand for Chinese exports decrease, the Chinese government has to choose which strategy they want to employ. Do nothing and the Yuan will weaken leading to more internal inflation and possibly some macroeconomic complications for the Chinese economy. However, what we can see from the Chinese response is that instead they are choosing to protect the Yuan by selling US treasuries to buy up more Yuan to prop up the value of the Yuan."
  },
  {
  "id": "5101",
  "header": "A Review on the Prediction Scenarios We Made on the 4th of April and What the US Administration is likely to do.",
  "date": "11 Apr 2025",
  "description": "The last time we mentioned that one of the scenarios this tariff situation will pan out is that the US will remove its own tariffs if others come to the negotiating table. Even though the US merely suspended the tariffs (once again...) the two basically mean the same. Now with the US-China trade war ramping up, I believe the US will need to get as many allies on its side and prevent them from feeling alienated which will make them lean over to China. Therefore, it is highly likely that the Trump administration will employ a softer stance on trade deficits with other countries. Furthermore the revenue from tariffs are not even enough to cover the huge piling debt that the US faces. There are only a few ways that the US can increase its revenue quickly and effective and one of them is the good old income taxes. Although Trump promised against this during his campaign, it is the only quickest and most efficient way of raising money. Laying off employees like a startup does not work in bureaucratic governmental institutions. Therefore, it is probable that Trump will raise taxes on the rich and increase capital gains tax. But many will ask won't Trump's friends get angry? That is where the effects of uncertainty of tariffs come in. With these huge swings and dips in the market, I believe Trump has prompted all his rich friends on when it's the right time to buy or sell so that they can make billions from the working class who are buying high and selling low in a panic. Then after all his friends have earned a significant wealth gain will he introduce the new income taxes on the richest. That way, the wealth of the richest has not changed, while the working class suffer without knowing what happened because on the surface Trump merely taxed the rich but in actuality there has been a transfer of wealth from the working class to the rich going on in the stock market."
  },
  {
  "id": "5100",
  "header": "Dead Cat Bounce Upon Trump’s Adjusted Tariffs Policy",
  "date": "10 Apr 2025",
  "description": "The US has increased the tariff rate on China to 126% in a tit-for-tat battle while it has also reduced tariffs for every other country to 10% base tariff. Never forget the power of Reactive Adaptation where after a huge period of discomfort someone will step in to correct the situation as we have seen with Dollar Tree’s pivot and the appointment of Intel’s new CEO. When things tend to go bad, an actor usually the most affected will step in. For example, when stocks fall so much to the point that people are worried about their 401Ks they will come out to protest their leadership. This is just one example of Reactive Adaption. Buy the dip or catch the falling knife is inherently uncertain. By the time you get indication that the macroeconomic conditions are going well, it would already have been instantaneously priced into the market which is why always buy when you think it’s going bad because once it recovers it is hard to get on the train. Today, AMD soared 23% while the S&P500 went up by 6%"
  },
  {
  "id": "5094",
  "header": "Obliteration Day for Stocks After Major Trump Tariffs Announcement",
  "date": "04 Apr 2025",
  "description": "After Trump’s rollout of the worldwide reciprocal tariffs on many countries stocks fell in many regions. In the US the VIX shot up to 30.52 indicating major fear and uncertainty in the market. Almost every stock is down about 10% or more, the hardest hit ones are the chips and tech stocks. A few scenarios this can pan out: First, the tariffs get placed and affected countries retaliate, the US market goes into a stagflation territory where the Feds cannot reduce the rates any further but cannot increase it either due to slowing economic activity and struggling businesses. Second, some countries might see it as unnecessary pain and remove their own tariffs to prompt the US to remove theirs too. Third, I believe many politicians congress and representatives alike own shares and as much as they love their country I believe as true Americans they love their money even more. Therefore, it is not off the table for congress to pass a bipartisan bill to either take over the executive control of tariffs or revoke it. Four, this may be an elaborate scheme Trump informed his wealthy friends before hand that he would cause chaos in the market and they should buy up before he reverses course which makes it a legal transfer of wealth from the working class Americans who sold in a panic. As much as we think the market is in utmost fear, we have to also remember that Trump has made TSMC and others including Saudi Arabia sign an investment pledge in the US in the coming years, building fabs and factories locally. Last but not least, we cannot forget the impeachment which is a possibility if republicans think enough is enough. Overall, even though Trump’s tariffs might not raise as much as expected, it is still a widely popular policy in place of direct taxation which like in the UK’s case we have seen how inaction leads to worsening economic conditions and a compounding difficult and harsh reality ahead to pay off their national debt. Before this recession and tariffs, many analysts were worried about the rising US national debt and ever increasing interest payments. However, now that Trump has outlined exactly how his administration will obtain more money to reduce the spending deficit the national debt question has to been traded in for a short term recessionary one. Despite Trumps choices the current economic landscape is not a bright one to be in. It’s going to be tough decisions after tough decisions."
  },
  {
  "id": "5086",
  "header": "DLTR Spins Off Family Dollar After Earnings Shock",
  "date": "27 Mar 2025",
  "description": "This just goes to show that sometimes it’s alright to buy into large cap stocks with huge drop in share price because eventually the board (people who are most affected by the drop in share price) will implement a structural change to turn the company around. As we have seen with INTC the board got distressed and announce a new CEO causing its stock price to jump. DLTR’s 11% jump is still far from the $130 last year."
  },
  {
  "id": "5078",
  "header": "Google’s $32B Acquisition of Cybersecurity Firm Wiz",
  "date": "19 Mar 2025",
  "description": "Wiz is an Israeli startup founded in 2020 with its latest funding round valuing it at $12B. Last July, Google approached Wiz to buy it out for $24B; however, due to antitrust concerns and valuation disagreements, the deal fell through. Now, Google is acquiring Wiz for $32B, a massive premium. Though seemingly overpaid, this is a strategic move to secure the cybersecurity of Google Cloud. Like government investment in highways, the return may take years, but it's foundational. As Google aims to take cloud market share from AWS, this acquisition strengthens its infrastructure and mitigates risk from cyber threats, which could otherwise become a major bottleneck."
  },
  {
    "id": "5070",
    "header": "There is a theory that suggests that Trump is purposely creating uncertainty and chaos in the market with all this short-term 180 decision to tank the market",
    "date": "11 Mar 2025",
	"description": "The thesis is that trump is doing this so that the Feds will have no choice but to cut the interest rates which will make the cost of borrowing/cost of interest payments on bonds go down. How is he going to accomplish it? First crash the stock market and make unemployment increase until there is a slowdown in the economy which might force the Fed’s hand. Though this plan may back fire in the form of stagflation I believe this is the playbook Trump is going by."
  },
  {
    "id": "5059",
    "header": "AppLovin down another 8% after yet another S&P500 snub",
    "date": "10 Mar 2025",
	"description": "Patience is key keep holding this potential stock and one day in a better macro condition market when it gets added to the S&P500 the stock will skyrocker. DoorDash which is chosen over AppLovin has over double the revenue of AppLovin significantly higher Free Cash Flow at $5B vs$0.7B however both DoorDash’s operating margin and revenue growth is tremendously below that of AppLovin. In that sense, DoorDash is a relatively cash rich company which is a good thing but AppLovin is poised for more growth. DoorDash faces competitor pressures from Uber Eats, Grub Hub in a highly commoditized market while AppLovin’s valuation could be said to be priced to near perfection meaning if the expected high growth does not continue its stock price is bound for a sizeable correction. Ultimately, AppLovin has greater growth prospect at the expense of risk."
  },
  {
    "id": "5066.5",
    "header": "AVGO up after hours after an earnings report that showed the AI trade is definitely not dead yet",
    "date": "07 Mar 2025",
	"description": "AVGO is up 16% in after hours as they beat EPS estimates and provide positive guidance"
  },
  {
    "id": "5066",
    "header": "S&P500 fell back to the level of $5700 first crossed in 18 Sep 2024 as traders deal with tariff uncertainty. The general consensus is that the Fed wont be cutting rates in the upcoming meeting due to rising inflation that could be caused by tariffs.",
    "date": "07 Mar 2025",
	"description": "SOFI which performance is tied significantly in correlation to the rate cuts took a big hit sliding to $12.45"
  },
  {
    "id": "5057",
    "header": "APP just plunged 15.79% to $318 Premarket",
    "date": "26 Feb 2025",
	"description": "This price fall follows a short report that highlights AppLovin’s unethical and illegal ad practices including data theft from Meta that contributed to its current growth rate Last April 2024, fuzzy panda’s report on Globe Life Inc caused it to plunge 50% in the following run up till today Globe Life Inc has rebounded 108% from that low Another example is ASP Isotopes although short term a lot of volatility is created in the long term the stocks still recovered What I think: this is a perfect opportunity to grab some APP shares (cautiously) at a discount like SMCI except I believe APP above a 50% drop is more attractive and stable this is not any accounting fraud but business practices fraud which are harder to probe than numbers i will enter at $250 which is 50% drop from its ATH"
  },
  {
    "id": "5052.5",
    "header": "CELH celsius energy drink stock is interesting as my stock ratings program tells me that though the company fundamentals are not that good it is not supposed to be trading this cheap",
    "date": "21 Feb 2025",
	"description": "At -40% from 1 YA it is definitely trading at an attractive price but since I’m already betting on AMD which is another company with not so stellar fundamentals but highly undervalued I won’t be adding CELH to my portfolio despite its huge potential upside when a downturn/bear market hits its the Googles and NVIDIAs that can weather the storm with their sound fundamental not cheap cigarette butts granted these stocks will do well in bull market but we are 2 just 2 months into 2025 nobody knows how this year is going to pan out yet. I pick AMD over CELH and will therefore not get involved in CELH. I am thinking about concentrating my portfolio even further down to only 5 stocks: APP, AMD, NVDA/AVGO (count as one discard after earnings), MU, SOFI meaning I have to liquidate INTC"
  },
  {
    "id": "5052",
    "header": "DIRECTIVE: going forward we will substitute PLTR for AppLovin, do not allocate capital for PLTR anymore unless it crashes and gets cheap again meanwhile pivot PLTR’s supposed capital to capture APP [Chatgpt reasoning+search used prompt: compare APP and PLTR tell me which has more room to grow and which is more overvalued tell me about their customer base for example NFLX has 300M users]",
    "date": "21 Feb 2025",
	"description": "1) AppLovin has larger room to grow as the mobile usage and digital ad spend increase, highly scalable unlike PLTR’s consultancy model (every specialist for its 500 companies) 2) PLTR serves a niche small but high value customer base (large enterprise and government clients) [expansion in commercial sector is promising but priced in] 3) high revenue multiples 50x, investors are in speculative territory which may not be sustainable once AI hype and grow slows. AppLovin on the otherwise has a more reasonable premium although it still trades at a premium due to strong growth prospects however its valuation is more in line with the overall market potential. AppLovin has a lower relative overvaluation compared to PLTR considering its fundamentals and vast market opportunity. Even though its direct customer count (developers) might be lower its consumer reach (aggregated end-user base) is enormous"
  },
  {
    "id": "5051.6",
    "header": "Looking at META’s run last year I noticed it dropped to the $430 range and took 2 month (30 April to 10 July) to recover to the $530s",
    "date": "20 Feb 2025",
	"description": " Plan of action: liquidate APP for a possible reentry at $430 leave one-third behind"
  },
  {
    "id": "5051.5",
    "header": "AMD stock has been on a steady climb since last week",
    "date": "20 Feb 2025",
	"description": "AMD is trading at $116 today which puts my 19 Dec 2025 Call Option of Strike $90 valued at $3.53K"
  },
  {
    "id": "5051",
    "header": "PLTR down 15% after proposed defense budget cuts",
    "date": "20 Feb 2025",
	"description": "I will not be DCA’ing into PLTR even at $104 because my DCF of PLTR at $87 tells me that it is a little too hyped up right now thankfully i sold 2 thirds of my position at $118 left one-third in to have some exposure to unforeseen price runs"
  },
  {
    "id": "5049",
    "header": "INTC jumped 17% upon rumours that TSMC and AVGO may acquire parts of Intel",
    "date": "18 Feb 2025",
	"description": ""
  },
  {
    "id": "5044",
    "header": "APP popped off 33% after earnings beat",
    "date": "13 Feb 2025",
	"description": "What this proves is the efficacy of my Stocks Rating App every one of my highly rated stocks from AVGO to PLTR all saw high performance in the last few months. Netted about $2000 from this whole appreciation. My view is that this stock is similar to Netflix their user base is around the same size at 300 million so I will not sell a single share and keep holding till it reaches 90% of NFLX market cap of $443B now. Sold off some PLTR few days ago because PLTR is really starting to get tricky but unlike APP i’m super behind this stock and I’m optimistic"
  },
  {
    "id": "5041",
    "header": "Bought an AMD Call option expiry 19 Dec 2025 strike $90 at market price $109 for $30.85",
    "date": "10 Feb 2025",
	"description": "Although AMD is only rated 9 ish in my system, my DCF tells me its valuation should be at $175 not $109 plenty upside after speculators’ fear dumping. Few things to note here: yes it is a volatile chip stock subject to administration policies and China-Taiwan geopolitical tension as AMD still relies heavily on TSMC for the production for its chips. However, when you look at factors supporting its valuation you see their Epyc CPUs which are highly favoured in data centers over Intel CPUs furthermore every 10 GPU needs a CPU (rough estimate here). If their data center revenue fell short this quarter its good news that they still have ceiling to grow the next quarter. I will keep doing Poor Man’s Covered Calls at $135 for June 2025 and I believe we might see upwards movement in either March like it did last year (when it skyrocketed to $210) or late 2025 which I’ll then roll my LEAPs to a later date. One more point about AMD options is that in the past whenever IV is low the price is bound to have large movements over the next few months."
  },
  {
    "id": "5036",
    "header": "PLTR post earnings jump 25%, Karp: “beginning phase of AI”, huge growth in US Gov and US Commercial sector double digit growth",
    "date": "5 Feb 2025",
	"description": "Only managed $600 from this stock boost as I sold my LEAP last friday. Do i regret my decision? no. Is there anything to be learned from this? yes. IV crush does not affect LEAP that still has 6 months that significantly. LEAP rose from 3.2k to 4.9k about 50% increase while the underlying stock only rose 25%. One thing i learned is to use the factors of earnings: 1) expectation, 2) surprise, 3) outlook, 4) company restructure (CEO step down?), 5) use news report leading up to earnings (newly formed gov contracts)"
  },
  {
    "id": "5034",
    "header": "lots of stock developments today after announcement of trump tariffs 25% on canada and mexico",
    "date": "3 Feb 2025",
	"description": "DLTR dropped 7% back to $68 just $1 below my intrinsic calc of $69 last year proving my analysis to be quite spot on, also stocks are falling all across the board except for VISA. TSLA and NVDA odwn 4% due to export controls and tariffs… Cash position is largest at $5700 on lynns account perfect opportunity to do stock sweep purchasing. Thankfully i liquidated my PLTR option as PLTR came back to $80 level from $84, i have so do some purchasing today or the opportunity cost would be burned. SOFI at $15.02 but i have designated LZ account to purchase it lower with $400 budget so we will monitor that, in the meantime not buying APP/PLTR due to them being too close to earnings call. PLTR is today and APP is next week 13th Feb."
  },
  {
    "id": "5029",
    "header": "Development in DeepSeek. The consensus now is that though V3 is trained from the ground up, R1 may have used outputs by API calls to ChatGPT to train its reasoning capabilities. Which is why they are able to do unsupervised GRPO training as they pull answers from other LLM.",
    "date": "29 Jan 2025",
	"description": ""
  },
  {
    "id": "5030",
    "header": "NVDA drops 4% amid Trump’s hint of more export controls including the newly-tweaked H20 chips designed for the Chinese market",
    "date": "30 Jan 2025",
	"description": ""
  },
  {
    "id": "5028",
    "header": "Basically the AI stock landscape boils down to just these 2 questions: are the Chinese lying about their costs and unit numbers or are the Americans being unreasonably defensive.",
    "date": "28 Jan 2025",
	"description": "If you think the Chinese are indeed lying about the equipments used to produce R1 then buy, buy, buy AI stocks now, the competition will be much fiercer everyone will be trying to come up with a better model. If you think the Americans are in denial and actually caught up, you will find yourself in a bearish stance on this sector. *One undeniable fact is that they are definitely more efficient than ChatGPT but the question is “by how much?”. 5% of ChatGPT may be overblown but since its more efficient at inference its def more efficient than OpenAI’s"
  },
  {
    "id": "5028",
    "header": "One valid observation from this DeepSeek fiasco is how complacent US corporations have become, hiding before the artificial moat that protectionism policies created",
    "date": "28 Jan 2025",
	"description": "Now that the mirror is shattered, US companies will have to up their game, reorganize and respond accordingly especially Meta and OpenAI. "
  },
  {
    "id": "5028",
    "header": "AI and Apple’s decision to go Unified Memory might have saved Apple from the impending innovation stagnation and slowing iPhone sales.",
    "date": "28 Jan 2025",
	"description": "With Unified Memory business and home users can now build their own AI clusters using a lower price to value ratio as the memory in silicon chips can be used by CPU and GPU unlike NVIDIA vram which is only 24GB for the high end consumer grade graphics card and for higher the price tag is $30,000 for A100 or even more for Hopper series  There will be a pivot in the tech sector where people will move away from unaffordable GPU clusters to budget friendly mac mini clusters powered by EXO library that controls the node gpus. "
  },
  {
    "id": "5027",
    "header": "DeepSeek R1 model is sending shockwaves through AI and tech companies like GOOGL, META, AMZN, AVGO, NVDA",
    "date": "27 Jan 2025",
	"description": "Even my mom and dad has heard about this latest R1 model which means their prevalence is picking up steam. Investors are rightful to be concerned as the training of this model only costs $5.6 million wildly under the cost OpenAI undertook to develop Chatgpt o1 model. Furthermore, DeepSeek proved that efficiency of the code is more important than the powerfulness of the GPUs you train the model on. Even with chip export restrictions from the US, DeepSeek still managed to train such a superb model although it’s an open secret that DeepSeek definitely has some high end GPUs bypassing the export curb by acquiring them from third party sellers. The AI race has officially entered main stage. Even though chip stocks are falling because of this, they stand to gain from it too as the competition will just grow fiercer and demand for high end GPUs will accelerate. Just because a Honda is fuel efficient and can get you from point A to point B does not mean people will stop seeking the Porsche that can get you there faster albeit it consumes more fuel."
  },
  {
    "id": "5027.5",
    "header": "NEVER BET ON EARNINGS, SOFI beat earnings with positive members growth but stock still fell 14%",
    "date": "27 Jan 2025",
	"description": "I bought 65 shares at $15.4 using the $800 i liquidated from SOFI last week. I almost bought more into earnings thankfully i didnt go all in on earnings. When the whole market is expected positive report and already priced it in as seen with the price increase of SOFI stock, even if the stock does deliver the stock might fall I feel like the panic is unjustified so i bought in if history were to repeat we should see SOFI do a huge recover tmr"
  },
  {
    "id": "5022",
    "header": "ARM jumped 14% to $174 upon news of Softbank Massa and Trump Cooperation",
    "date": "22 Jan 2025",
	"description": "Softbank and Trump is launching a private investment into the AI sector launching a new project Stargate"
  },
  {
    "id": "5022.5",
    "header": "NFLX up 14% after market post earnings",
    "date": "22 Jan 2025",
	"description": "EPS for Q4 up 19% YoY, revenue up 99%, final report of subscribers at 302million, boosted by squid game 2 and Jake x Tyson "
  },
  {
    "id": "5023",
    "header": "SOFI jumped 5% to $17.30 after trump’s inauguration (21-1-2025)",
    "date": "23 Jan 2025",
	"description": "liquidated a quarter of my position in SOFI"
  },
  {
    "id": "5016",
    "header": "SOFI, AFFIRM stock up 7% to $15.51 from weeks low of $13.41",
    "date": "16 Jan 2025",
	"description": "Due to banks outperform rating on its stock plus though its faced with interest rate hiccups this year and last year is really the years for PLTR and SOFI Imo they stock having will trading under for too long, SOFI rise today also due to cooler than expected CPI inflation report at 3.2%"
  },
  {
    "id": "5013",
    "header": "Hedge Funds are playing a game: selling the stocks that are hyped by investors and most-paraded on YouTube (TSLA, PLTR, SOFI, APP",
    "date": "13 Jan 2025",
	"description": "Is there a coincidence these tech stocks are similarly down ~20% from recent ATH while other stocks not as talked about by YouTubers are only down ~10% (NVDA, AVGO, AMZN) Clearly the big funds are trying to use this macro opportunity to whack all the small retail traders by trading off their position causing a panic in new inexperienced traders who then sell their positions off at a loss further pushing everything down. These are good stocks I have picked (except for SOFI considering the absence of IR cuts) I see no point in panicking in my position their are well averaged well fortified and just got to hold out this storm though im considerably worried for my bout-to-expire PLTR option (Im like caocao at guandu rn just praying for a miracle other than that I cant retreat) [good fundamentals is good fundamentals]"
  },
  {
    "id": "5002",
    "header": "DLTR broke $77 since August plunge to low of $60 this is 11% higher than my former average position of $69",
    "date": "2 Jan 2025",
	"description": "New CEO from inside Michael Creedon to turn the company around"
  },
  {
    "id": "5003",
    "header": "SOFI down 5% largest single day drop since last August",
    "date": "3 Jan 2025",
	"description": "Mainly due to analyst downgrades and it being prices 3x over its peers and how inflation remain sticky with hopes of multiple rate cuts in 2025 dimmed which could have really helped SOFIs margin (what I think is: leave it let the sellers sell when the next report come around or anything it will recover as retail investors/hype investors scoop up the shares"
  },
  {
    "id": "4362",
    "header": "PLTR retreated back to $78 from new Christmas Eve high of $84.90",
    "date": "28 Dec 2024",
	"description": "Take note that pltr always does this pullback after forming new all time high as it did at $74 level but as history shows its going to bounce back I could have sold my option and joined back at a lower price but I only had one option of pltr and don’t wna risk losing it"
  },
  {
    "id": "4352",
    "header": "All red across stock market S&P500 dropped 2% after Fed Chair proposed only 2 rate cuts next year after this year’s 0.25% cut due to “unstable political outlook” and “accelerating inflation at 2.7%”",
    "date": "18 Dec 2024",
	"description": ""
  },
  {
    "id": "4347",
    "header": "AVGO pops 22% to $220 I have a position with the average of $159.6",
    "date": "13 Dec 2024",
	"description": "CEO revised 2025 Q1 estimates higher citing strong AI Chip demand 'AI revenue is projected to skyrocket to at least $60 billion to $90 billion in fiscal 2027', the CEO said VMware acquisition drove software infrastructure revenue growth Dividend increase 11% to $0.59"
  },
  {
    "id": "4344",
    "header": "Reflection: I feel like its 5th of Aug again the market is down due to carry trade of yen and I don’t have any more funds to DCA PS: be more aware of pullbacks after ATH you will see it quick often",
    "date": "10 Dec 2024",
	"description": "APP and PLTR slipped after recent all time highs but 1: I didn’t cancel my APP $373 after purchasing $386 2: most of my funds are tied up in stocks so when APP fell to $342 or PLTR at $72 I do not have the means to double down  PLTR and APP are just feeling the momentum pressure of selling as PLTR hit $83 ATH in the early morning investors started taking profits, I expect it to recover very soon while APP is at a very attractive and healthy buy point now after the 14% correction I only have a measly reserve of $980 left in (Lynn acc) which is enough for 2 APP or plenty of PLTR or I could hold and wait for further drops… Decision is to be made soon Action: might trim all the other side stocks AVGO AMD META AMZN to recoup funds but with chips sector at a decline due to Chinese probe into NVDA antimonopoly violation the chips stock I own cant be alleviated as of now only AMZN and META can be relieved"
  },
  {
    "id": "4343",
    "header": "APP falling 11% due to news that it is being snubbed from snp500",
    "date": "9 Dec 2024",
	"description": "I see it as a good thing this gives me more confidence in the stock instead as it provides a healthy correction opportunity from all the hype and as long as you are long term this stock you shouldn’t have to tweak or worry about anything just keep DCA’ing, will buy more tmr This stock is like the young player which has high potential where the coach says im not putting u in the team not because u aint good but u have much more potential I’ll let the seniors have a chance first. In other words this is like Simon telling Liam Payne to come back next year, furthermore APP is a very recent company IPO’d in 2021 while PLTR had been in the market since 2019 so its understandable SNP500 skipped APP"
  },
  {
    "id": "4343.5",
    "header": "SOFI Thesis",
    "date": "9 Dec2024",
	"description": "Lower rates will increase their profitability as they were playing conservative game during high and long IR as to not get burnt by delinquencies. Bad: rsu for employees (however these are considered “good” dilution as employees become more motivated to contribute) From 9 Sep 0.5 rate cut to right before 7 Nov 0.25 cut, they rallied 42%. From nov 7 rate cut to today they rallied another 35%. Sofi might increase another 25% at least by the end of this month after Dec 18 which will see the stock reach $20"
  },
  {
    "id": "4341",
    "header": "APP analysis DCF $1104 rated 22.43",
    "date": "7 Dec 2024",
	"description": "APP users 1.4B market cap now $114B, NFLX 282M market cap now $367B, I see APP growing to NFLX market share over the next year like NFLX was at Dec 2023 ($403)  APP does not need to produce its own content like NFLX which gives it lower costs and higher operating margin. With its AXON AI its basically like PLTR super scalable low marginal cost the only thing they have on their plate is to worry about competition and as long as they can maintain they current customers and user profiles they will always have an edge because its not just analysis that is important but the data garnered and AAPL made $26B from App Store, GOOGL $48B from Play Store (combined $74B) lets say APP only captures 2% of market its already $1.48B what’s more APP ttm revenue is already at $4.29B only going to grow larger  LAST POINT: with every new user/data the AXON engine is only going to get more refined and smarter"
  },
  {
    "id": "4316",
    "header": "ANALYSIS on DLTR, PLTR, NVDA",
    "date": "12 Nov 2024",
	"description": "DLTR is having some strong headwinds but i cant board is going to step up and name a successor CEO, (dividend is unlikely, buybacks unlikely), what i think will happen is that board will create something that will make investors more optimistic of the company. PLTR main concern now is not whether their software is good or not, its all up to their sales team of how they pitch their software for unique use cases for their potential clients now. PLTR is not overvalued just yet like how NVDA is not, just a little hot. NVDA according to last year 2023, NVDA price may slump in Dec 6, (chips export restriction, cooling AI demand, uncertainty about trump policies) [right now NVDA is inflated as everyone is buying new GPUs to join in bitcoin mining after bitcoin surge ATH after trump won so better to wait it out]"
  },
  {
    "id": "4315",
    "header": "SHOP is a good stock (rated 12.299)",
    "date": "11 Nov 2024",
	"description": "without adding V (which doesnt even compete wit h SHOP as much as PYPY) rating would be 13.299, average margin but good earnings recover from post covid slump"
  },
  {
    "id": "4314",
    "header": "BUY NVDA (rated 26.207) after trump hype dies abit",
    "date": "10 Nov 2024",
	"description": "NVDA though upside growth is unsustainable, it is still a monopoly at what it does: supplying high tier GPU’s not even AMD can compete, hedge risk by not buying more than 10 NVDA in ccase of AI crash"
  },
  {
    "id": "4314.5",
    "header": "BUY PLTR (rated 15.263)",
    "date": "10 Nov 2024",
	"description": "likely to grow more in the future however try to wait out this trump rally for pries to drop back down first, recent near billion dollar contract signed with National Defence"
  },
  {
    "id": "4313",
    "header": "Decision to make: consumer staples sector got huge spike in stock price DLTR went up 5%",
    "date": "09 Nov 2024",
	"description": "due to recent economic data showing inflation coming in hotter than expected, dollar general and dollar tree have been going up Question now is : is trump going to win, cuz if he does then i’ll have to sell off my position as 42% of DLTR goods are imported from China and it will hurt their bottom line Also one thing to note since 2019 DLTR and Dollar General stock prices after earnings have been in tandem so far "
  },
  {
    "id": "4217",
    "header": "Stock Market Plunge, Nikkei crash more than 10%",
    "date": "05 Aug 2024",
	"description": "Carry trade (which refers to investors using currency from low interest rate region eg Japan to trade securities overseas with higher return. Today it is announced that Japan will hike its IR for the first time in a long time. Arbitrage traders forced to liquidate their positions. Besides, recession fears and negative market sentiment towards crash makes regular retail investor panic even TikTok is circulating recession doom that a friend messaged me to warn me. However, market recovered the next day with opportunistic traders scooping up shares at a discounted price."
  },
  {
    "id": "4209",
    "header": "GRAB bad fundamentals",
    "date": "28 Jul 2024",
	"description": "Caring too much about acquiring loyal customers when really most people will just flock to service which is cheapest, yes although it has many divisions other than ehailing such as grocery delivery, food delivery, and grabpay, however there are many competitors in this field undercutting their profits: food panda, touchngo. Market share in SEA although largest at 37.7M still captures minimal percentage of 600M population. Still no profit when in truth their focus should be from capturing market share to actually turning green, company lost focus in growth narrative"
  }
]



















